app/views/users/likes.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 3]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
---
            <% @likes.each do |like| %>
            <% post=Post.find_by(id:like.post_id)%>