app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "updated_at", "competition", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "タックルのコツ"], ["created_at", "2021-08-30 12:43:59.669254"], ["updated_at", "2021-08-30 12:43:59.669254"], ["competition", "アメフト"], ["user_id", 1]]
---
  def create
    @post=Post.new(
      content:params[:content],
      user_id:@current_user.id,
      competition:params[:competition]
    )
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "バッティングがうまくなる方法"], ["updated_at", "2021-08-27 08:18:40.166734"], ["id", 15]]
---
  def update
    @post=Post.find_by(id:params[:id])
    @post.content=params[:content]
    @post.competition=params[:competition]
    if @post.save