app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "password") VALUES (?, ?, ?, ?, ?, ?)  [["name", "mail"], ["email", "mail"], ["created_at", "2021-08-27 08:16:44.240423"], ["updated_at", "2021-08-27 08:16:44.240423"], ["image_name", "default_user.jpg"], ["password", "mail"]]
---
  def create
    @user=User.new(
      name:params[:name],
      email:params[:email],
      image_name:"default_user.jpg",
      password:params[:password]
    )
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "image_name" = ?, "sport" = ? WHERE "users"."id" = ?  [["updated_at", "2021-08-30 12:43:39.180737"], ["image_name", "1.jpg"], ["sport", "アメリカンフットボール"], ["id", 1]]
---
  def update
    @user=User.find_by(id:params[:id])
    @user.name=params[:name]
    @user.email=params[:email]
    @user.sport=params[:sport]

    if params[:image]
    @user.image_name="#{@user.id}.jpg"
    image=params[:image]
    File.binwrite("public/user_images/#{@user.image_name}",image.read)
    end
    if @user.save