app/views/layouts/application.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        <% if session[:user_id]%>
        <% current_user=User.find_by(id:session[:user_id])%>